// 在遥远的憨憨王国，有一个铁憨憨骑士团。
// 在骑士团的团员憨森所居住的小屋旁边，有一座小木桥。由于木桥很窄，同一时间桥上只能有一个人。每当有人通过木桥，木桥就会发出嘎吱嘎吱的声音。
// 经过一段时间的观察，憨森发现，每当有骑兵骑着马通过木桥的时候，木桥发出的声音要比走路的步兵通过的时候更大。具体来说，如果发出的声音大于 70
//  分贝，那么就代表着这是一个骑兵，否则就是一个步兵。
// 这天，憨森记录下了 n 次有人通过木桥时发出的声音大小。他想知道，这之中有多少次是骑兵通过的？

// 输入数据
// 第一行一个整数 n(1≤n≤105) ，表示这一天憨森一共记录下了 n 次声音。接下来一行 n 个整数
// 其中第 i 个整数 di(1≤di≤140) 表示第 i 次声音的大小。

// 输出数据
// 一行一个整数 ans ，表示这些声音中有几次是骑兵通过发出的。


#include <iostream>
using namespace std;

int main(){
    int times;
    int voices[10000];
    cin >> times;
    int count = 0;
    
    for(int i = 0;i < times;i++)
    {
        cin >> voices[i];
        if(voices[i] > 70)
        {
            count++;
        }
    }

    cout << count << endl;
    return 0;
}
